id: sysprefs_screensaver_ask_for_password_delay_enforce
title: "Enforce Session Lock After Screen Saver is Started"
discussion: |
  A screen saver _MUST_ be enabled and the system _MUST_ be configured to require a password to unlock once the screensaver has been on for a maximum of five seconds. 
  
  An unattended system with an excessive grace period is vulnerable to a malicious user. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/egrep -o -e "askForPasswordDelay\s=\s([^;]+)" | /usr/bin/awk '{ if ($3 <= 5) {print "Yes"} else {print "No"}}' | /usr/bin/sort -u
result:
  string: "Yes"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85442-2
  cci: 
    - CCI-000056
  800-53r5:
    - AC-11
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - APPL-11-000003
  800-171r2:
    - 3.1.10
macOS:
  - "11.0"
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPasswordDelay: 5